#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_api_management_api.to_do_api will be destroyed
  # (because azurerm_api_management_api.to_do_api is not in configuration)
  - resource "azurerm_api_management_api" "to_do_api" {
      - api_management_name   = "dx-d-itn-playground-pg-apim-01" -> null
      - api_type              = "http" -> null
      - description           = "To Do List API" -> null
      - display_name          = "To Do API" -> null
      - id                    = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api;rev=1" -> null
      - is_current            = true -> null
      - is_online             = false -> null
      - name                  = "to-do-api" -> null
      - path                  = "api/v1" -> null
      - protocols             = [
          - "https",
        ] -> null
      - resource_group_name   = "dx-d-itn-test-rg-01" -> null
      - revision              = "1" -> null
      - soap_pass_through     = false -> null
      - subscription_required = true -> null
        # (6 unchanged attributes hidden)

      - import {
          - content_format = "openapi" -> null
          - content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
                  version: 0.0.0
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                components:
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
            EOT -> null
        }

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

  # azurerm_resource_group.dynatrace_rg will be created
  + resource "azurerm_resource_group" "dynatrace_rg" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-playground-pg-dynatrace-rg-01"
    }

  # azurerm_subnet.dynatrace_snet will be created
  + resource "azurerm_subnet" "dynatrace_snet" {
      + address_prefixes                               = [
          + "10.50.10.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dx-d-itn-playground-pg-dynatrace-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dx-d-itn-network-rg-01"
      + virtual_network_name                           = "dx-d-itn-common-vnet-01"
    }

  # module.dynatrace_activegate.azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "pagopa"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "italynorth"
      + max_bid_price                                          = -1
      + name                                                   = "dx-d-itn-activegate-vm-01"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "dx-d-itn-playground-pg-dynatrace-rg-01"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "CostCenter"  = "TS700 - ENGINEERING"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Dev"
          + "Owner"       = "DevEx"
          + "Scope"       = "Dynatrace PoC"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.dynatrace_activegate.azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "italynorth"
      + mac_address                    = (known after apply)
      + name                           = "dx-d-itn-activegate-nic-01"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "dx-d-itn-playground-pg-dynatrace-rg-01"
      + tags                           = {
          + "CostCenter"  = "TS700 - ENGINEERING"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Dev"
          + "Owner"       = "DevEx"
          + "Scope"       = "Dynatrace PoC"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.dynatrace_oneagent.azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "pagopa"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "italynorth"
      + max_bid_price                                          = -1
      + name                                                   = "dx-d-itn-playground-pg-oneagent-vm-01"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "dx-d-itn-playground-pg-dynatrace-rg-01"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "CostCenter"  = "TS700 - ENGINEERING"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Dev"
          + "Owner"       = "DevEx"
          + "Scope"       = "Dynatrace PoC"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.dynatrace_oneagent.azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "italynorth"
      + mac_address                    = (known after apply)
      + name                           = "dx-d-itn-playground-pg-oneagent-nic-01"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "dx-d-itn-playground-pg-dynatrace-rg-01"
      + tags                           = {
          + "CostCenter"  = "TS700 - ENGINEERING"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Dev"
          + "Owner"       = "DevEx"
          + "Scope"       = "Dynatrace PoC"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
